Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A direct link–based data transmission method, wherein the data transmission method comprises:
de_de: 1. Datenübertragungsverfahren basierend auf einer direkten Verbindung, wobei das Datenübertragungsverfahren Folgendes umfasst:

source: obtaining (31, 51) configuration information, wherein the configuration information comprises at least one carrier identifier and a load threshold corresponding to the at least one carrier identifier;
de_de: Erlangen (31, 51) von Konfigurationsinformationen, wobei die Konfigurationsinformationen mindestens eine Trägerkennung und einen Lastschwellenwert umfassen, der mit der mindestens einen Trägerkennung korrespondiert;

source: selecting (32, 33, 34), based on a load capacity of each of a plurality of first transmission carriers and the load threshold corresponding to each of the plurality of first transmission carriers, at least one transmission carrier from all the first transmission carriers as a second transmission carrier, wherein each of the plurality of first transmission carriers is configured to transmit direct link data and corresponds to one of the at least one carrier identifier in the configuration information; and
de_de: Auswählen (32, 33, 34), basierend auf einer Lastkapazität von jedem einer Vielzahl von ersten Übertragungsträgern und dem Lastschwellenwert, der mit jedem der Vielzahl von ersten Übertragungsträgern korrespondiert, mindestens eines Übertragungsträgers aus allen ersten Übertragungsträgern als zweiten Übertragungsträger, wobei jeder der Vielzahl von ersten Übertragungsträgern konfiguriert ist, um Direktverbindungsdaten zu übertragen und mit einer der mindestens einen Trägerkennung in den Konfigurationsinformationen zu korrespondieren; und

source: transmitting (35, 54) direct link data on the second transmission carrier,
de_de: Übertragen (35, 54) von Direktverbindungsdaten auf den zweiten Übertragungsträger,

source: wherein the configuration information further comprises a preset probability threshold corresponding to the at least one carrier identifier,
de_de: wobei die Konfigurationsinformationen ferner einen voreingestellten Wahrscheinlichkeitsschwellenwert umfassen, der mit der mindestens einen Trägerkennung korrespondiert,

source: wherein a random number corresponding to each first transmission carrier is generated (52) by the terminal for each first transmission carrier, and
de_de: wobei eine Zufallszahl, die mit jedem ersten Übertragungsträger korrespondiert, von dem Endgerät für jeden ersten Übertragungsträger generiert wird (52), und

source: wherein the at least one transmission carrier comprises one of the first transmission carriers whose load capacity is less than or equal to the corresponding load threshold, and another one of the first transmission carriers whose load capacity is greater than or equal to the corresponding load threshold and whose corresponding random number is less than or equal to the probability threshold; or
de_de: wobei der mindestens eine Übertragungsträger einen der ersten Übertragungsträger umfasst, dessen Lastkapazität kleiner oder gleich dem korrespondierenden Lastschwellenwert ist, und einen weiteren der ersten Übertragungsträger, dessen Lastkapazität größer oder gleich dem korrespondierenden Lastschwellenwert ist und dessen korrespondierende Zufallszahl kleiner oder gleich dem Wahrscheinlichkeitsschwellenwert ist; oder

source: wherein the at least one transmission carrier comprises one of the first transmission carriers whose load capacity is less than or equal to the corresponding load threshold, and another one of the first transmission carriers whose load capacity is greater than or equal to the corresponding load threshold and whose corresponding random number is greater than or equal to the probability threshold.
de_de: wobei der mindestens eine Übertragungsträger einen der ersten Übertragungsträger umfasst, dessen Lastkapazität kleiner oder gleich dem korrespondierenden Lastschwellenwert ist, und einen weiteren der ersten Übertragungsträger, dessen Lastkapazität größer oder gleich dem korrespondierenden Lastschwellenwert ist und dessen korrespondierende Zufallszahl größer oder gleich dem Wahrscheinlichkeitsschwellenwert ist.

source: 2. The data transmission method according to claim 1, wherein the configuration information further comprises a data type identifier corresponding to the at least one carrier identifier; and
de_de: 2. Datenübertragungsverfahren nach Anspruch 1, wobei die Konfigurationsinformationen ferner eine Datentypkennung umfassen, die mit der mindestens einen Trägerkennung korrespondiert; und

source: the selecting, based on a load capacity of each first transmission carrier and the load threshold corresponding to the first transmission carrier, at least one transmission carrier from all the first transmission carriers as a second transmission carrier comprises:
de_de: Auswählen, basierend auf einer Lastkapazität jedes ersten Übertragungsträgers und dem Lastschwellenwert, der mit dem ersten Übertragungsträger korrespondiert, mindestens eines Übertragungsträgers aus allen ersten Übertragungsträgern als zweiten Übertragungsträger Folgendes umfasst:

source: selecting (42) the at least one transmission carrier from all the first transmission carriers that have a data type identifier corresponding to the direct link data as the second transmission carrier.
de_de: Auswählen (42) des mindestens einen Übertragungsträgers aus allen ersten Übertragungsträgern, die eine Datentypkennung aufweisen, die mit den Direktverbindungsdaten als zweiten Übertragungsträger korrespondieren.

source: 3. The data transmission method according to any one of claims 1 to 2, wherein the configuration information further comprises transmission resource pool configuration information corresponding to the at least one carrier identifier, the transmission resource pool configuration information comprises location information of a time-frequency resource block, and the load capacity of the first transmission carrier is a load capacity of a transmission resource pool corresponding to the corresponding transmission resource pool configuration information.
de_de: 3. Datenübertragungsverfahren nach einem der Ansprüche 1 bis 2, wobei die Konfigurationsinformationen ferner Übertragungsressourcenpool-Konfigurationsinformationen umfassen, die mit der mindestens einen Trägerkennung korrespondieren, wobei die Übertragungsressourcenpool-Konfigurationsinformationen Standortinformationen eines Zeit-Frequenz-Ressourcenblocks umfassen und die Lastkapazität des ersten Übertragungsträgers eine Lastkapazität eines Übertragungsressourcenpools ist, der mit den korrespondierenden Übertragungsressourcenpool-Konfigurationsinformationen korrespondiert.

source: 4. A direct link–based data transmission apparatus, wherein the data transmission apparatus comprises:
de_de: 4. Datenübertragungsvorrichtung basierend auf einer direkten Verbindung, wobei die Datenübertragungsvorrichtung Folgendes umfasst:

source: an obtaining unit (601), configured to obtain configuration information, wherein the configuration information comprises at least one carrier identifier and a load threshold corresponding to the at least one carrier identifier;
de_de: eine Erlangungseinheit (601), konfiguriert, um Konfigurationsinformationen zu erlangen, wobei die Konfigurationsinformationen mindestens eine Trägerkennung und einen Lastschwellenwert umfassen, die mit der mindestens einen Trägerkennung korrespondieren;

source: a selection unit (602), configured to select, based on a load capacity of each of a plurality of first transmission carriers and the load threshold corresponding to each of the plurality of first transmission carriers, at least one transmission carrier from all the first transmission carriers as a second transmission carrier, wherein each of the plurality of first transmission carriers is configured to transmit direct link data and corresponds to one of the at least one carrier identifier in the configuration information; and
de_de: eine Auswahleinheit (602), konfiguriert, um basierend auf einer Lastkapazität jedes einer Vielzahl von ersten Übertragungsträgern und dem Lastschwellenwert, der mit jedem der Vielzahl von ersten Übertragungsträgern korrespondiert, mindestens einen Übertragungsträger aus allen ersten Übertragungsträgern als zweiten Übertragungsträger auszuwählen, wobei jeder der Vielzahl von ersten Übertragungsträgern konfiguriert ist, um Direktverbindungsdaten zu übertragen und mit einer der mindestens einen Trägerkennung in den Konfigurationsinformationen zu korrespondieren; und

source: a transmission unit (603), configured to transmit direct link data on the second transmission carrier selected by the selection unit,
de_de: eine Übertragungseinheit (603), konfiguriert, um Direktverbindungsdaten auf dem von der Auswahleinheit ausgewählten zweiten Übertragungsträger zu übertragen,

source: wherein the at least one transmission carrier comprises one of the first transmission carriers whose load capacity is less than or equal to the corresponding load threshold, and another one of the first transmission carrier whose load capacity is greater than or equal to the corresponding load threshold and whose corresponding random number is less than or equal to the probability threshold; or
de_de: wobei der mindestens eine Übertragungsträger einen der ersten Übertragungsträger umfasst, dessen Lastkapazität kleiner oder gleich dem korrespondierenden Lastschwellenwert ist, und einen weiteren der ersten Übertragungsträger, dessen Lastkapazität größer oder gleich dem korrespondierenden Lastschwellenwert ist und dessen korrespondierende Zufallszahl kleiner oder gleich dem Wahrscheinlichkeitsschwellenwert ist; oder

source: 5. The data transmission apparatus according to claim 4, wherein the configuration information further comprises transmission resource pool configuration information corresponding to the at least one carrier identifier, the transmission resource pool configuration information comprises location information of a time-frequency resource block, and the load capacity of the first transmission carrier is a load capacity of a transmission resource pool corresponding to the corresponding transmission resource pool configuration information.
de_de: 5. Datenübertragungsvorrichtung nach Anspruch 4, wobei die Konfigurationsinformationen ferner Übertragungsressourcenpool-Konfigurationsinformationen umfassen, die mit der mindestens einen Trägerkennung korrespondieren, wobei die Übertragungsressourcenpool-Konfigurationsinformationen Standortinformationen eines Zeit-Frequenz-Ressourcenblocks umfassen und die Lastkapazität des ersten Übertragungsträgers eine Lastkapazität eines Übertragungsressourcenpools ist, der mit den korrespondierenden Übertragungsressourcenpool-Konfigurationsinformationen korrespondiert.

source: 6. A terminal, wherein the terminal comprises a memory and a processor connected to the memory, the memory is configured to store program code, and when the processor is configured to run or execute the program code stored in the memory, the terminal performs the method according to any one of claims 1 to 3.
de_de: 6. Endgerät, wobei das Endgerät einen Speicher und einen mit dem Speicher verbundenen Prozessor umfasst, wobei der Speicher konfiguriert ist, um Programmcode zu speichern, und wenn der Prozessor konfiguriert ist, um den in dem Speicher gespeicherten Programmcode auszuführen, das Endgerät das Verfahren nach einem der Ansprüche 1 bis 3 durchführt.

source: 7. A computer-readable storage medium, wherein the computer-readable storage medium stores an instruction, and when the computer-readable storage medium is run on a computer, the computer is enabled to perform the method according to any one of claims 1 to 3.
de_de: 7. Computerlesbares Speichermedium, wobei das computerlesbare Speichermedium eine Anweisung speichert und wenn das computerlesbare Speichermedium auf einem Computer betrieben wird, der Computer in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 3 durchzuführen.

source: Claims
de_de: Patentansprüche

source: 1. A ferrule, comprising a ferrule body (11) and at least one fiber (12) wherein
de_de: 1. Eine Ferrule, umfassend einen Ferrulenkörper (11) und mindestens eine Faser (12), wobei

source: at least one through hole (111) is axially disposed inside the ferrule body (11), each fiber (12) is inserted into a corresponding through hole (111), a first end (120) of the fiber (12) is located inside the through hole (111), and a vertical distance between an end face (121) of the first end (120) of the fiber (12) and a plane on which a connection end face (112) of the ferrule body (11) is located is a first preset distance, wherein the connection end face (112) is an end face that is of the ferrule and that abuts another ferrule, and the first preset distance is a distance that can leave a gap (35) between the fiber (12) of the ferrule and a fiber of the another ferrule after the ferrule abuts the another ferrule; and
de_de: mindestens ein Durchgangsloch (111) axial innerhalb des Ferrulenkörpers (11) angeordnet ist, jede Faser (12) in ein entsprechendes Durchgangsloch (111) eingesetzt ist, ein erstes Ende (120) der Faser (12) sich innerhalb des Durchgangslochs (111) befindet und ein vertikaler Abstand zwischen einer Endfläche (121) des ersten Endes (120) der Faser (12) und einer Ebene, auf der sich eine Verbindungsendfläche (112) des Ferrulenkörpers (11) befindet, ein erster voreingestellter Abstand ist, wobei die Verbindungsendfläche (112) eine Endfläche der Ferrule ist und an eine andere Ferrule angrenzt, und der erste voreingestellte Abstand ein Abstand ist, der einen Spalt (35) zwischen der Faser (12) der Ferrule und einer Faser der anderen Ferrule hinterlassen kann, nachdem die Ferrule an die andere Ferrule angrenzt; und

source: the through hole (111) comprises a first section (113) of through hole (111), a plane on which a top (14) of the first section (113) of through hole (111) is located is the plane on which the connection end face (112) is located, an area of any cross section of the first section (113) of through hole (111) in a direction vertical to an axial direction is greater than an area of the end face (121) of the first end (120) of the fiber (12), and a size of the first section (113) of the through hole (111) is greater than a size of the first end (120) of the fiber (12), such that a projection of the fiber (12) from the first end (120) in an axial direction of the fiber (12) does not touch the ferrule body (11);
de_de: das Durchgangsloch (111) einen ersten Abschnitt (113) des Durchgangslochs (111) umfasst, eine Ebene, auf der sich eine Oberseite (14) des ersten Abschnitts (113) des Durchgangslochs (111) befindet, die Ebene ist, auf der sich die Verbindungsendfläche (112) befindet, eine Fläche jedes Querschnitts des ersten Abschnitts (113) des Durchgangslochs (111) in einer Richtung vertikal zu einer axialen Richtung größer ist als eine Fläche der Endfläche (121) des ersten Endes (120) der Faser (12), und eine Größe des ersten Abschnitts (113) des Durchgangslochs (111) derart größer ist als eine Größe des ersten Endes (120) der Faser (12), dass ein Vorsprung der Faser (12) vom ersten Ende (120) in einer axialen Richtung der Faser (12) den Ferrulenkörper (11) nicht berührt;

source: wherein an area of a cross section of the first section (113) of through hole (111) in the direction vertical to the axial direction gradually increases from a bottom (13) to the top (14) of the first section (113) of through hole (111) characterized in that there is a chamfer (15) at an orifice of the first section (113) of the through hole (111), suitable for preventing an optical fiber from an abutting another ferrule from touching said connection end face of said ferrule.
de_de: wobei eine Fläche eines Querschnitts des ersten Abschnitts (113) des Durchgangslochs (111) in der Richtung vertikal zu der axialen Richtung allmählich von einer Unterseite (13) zu der Oberseite (14) des ersten Abschnitts (113) des Durchgangslochs (111) zunimmt, dadurch gekennzeichnet, dass es an einer Öffnung des ersten Abschnitts (113) des Durchgangslochs (111) eine Fase (15) gibt, die geeignet ist, zu verhindern, dass eine optische Faser, die an eine andere Ferrule angrenzt, die Verbindungsendfläche der Ferrule berührt.

source: 2. The ferrule according to claim 1, wherein an antireflection coating is plated on an outer wall of the fiber (12) located inside the first section (113) of through hole (111).
de_de: 2. Ferrule nach Anspruch 1, wobei eine Antireflexbeschichtung auf eine Außenwand der Faser (12) aufgebracht ist, die sich innerhalb des ersten Abschnitts (113) des Durchgangslochs (111) befindet.

source: 3. The ferrule according to claim 1 or 2, wherein an antireflection coating is plated on a hole wall of the first section (113) of through hole (111).
de_de: 3. Ferrule nach Anspruch 1 oder 2, wobei eine Antireflexbeschichtung auf eine Lochwand des ersten Abschnitts (113) des Durchgangslochs (111) plattiert ist.

source: 4. The ferrule according to claim 2 or 3, wherein the antireflection coating is configured to suppress reflection of a communications light wave in a non-fiber transmission medium.
de_de: 4. Ferrule nach Anspruch 2 oder 3, wobei die Antireflexbeschichtung dazu konfiguriert ist, die Reflexion einer Kommunikationslichtwelle in einem nicht faserbasierten Übertragungsmedium zu unterdrücken.

source: 5. The ferrule according to any one of claims 2 to 4, wherein the antireflection coating comprises N layers of films, and N is a positive integer greater than or equal to 1; and
de_de: 5. Ferrule nach einem der Ansprüche 2 bis 4, wobei die Antireflexbeschichtung N Filmschichten umfasst und N eine positive Ganzzahl größer oder gleich 1 ist; und

source: when N is greater than or equal to 2, refractive indexes of two adjacent layers of films are different.
de_de: die Brechungsindizes zweier benachbarter Filmschichten unterschiedlich sind, wenn N größer oder gleich 2 ist.

source: 6. The ferrule according to claim 5, wherein a chemical component of each layer of film is an organic compound or an inorganic compound.
de_de: 6. Ferrule nach Anspruch 5, wobei eine chemische Komponente jeder Filmschicht eine organische Verbindung oder eine anorganische Verbindung ist.

source: 7. The ferrule according to any one of claims 2 to 6, wherein a thickness of the antireflection coating is equal to 1/4 of a wavelength of the communications light wave.
de_de: 7. Ferrule nach einem der Ansprüche 2 bis 6, wobei eine Dicke der Antireflexbeschichtung 1/4 einer Wellenlänge der Kommunikationslichtwelle entspricht.

source: 8. The ferrule according to any one of claims 1 to 6, the bottom (13) of the first section (113) of through hole (111) is a top of a second section (114) of through hole (111), and the second section (114) of through hole (111) is a through hole other than the first section (113) of through hole (111) in the through hole (111).
de_de: 8. Ferrule nach einem der Ansprüche 1 bis 6, wobei die Unterseite (13) des ersten Abschnitts (113) des Durchgangslochs (111) eine Oberseite eines zweiten Abschnitts (114) des Durchgangslochs (111) ist und der zweite Abschnitt (114) des Durchgangslochs (111) ein anderes Durchgangsloch als der erste Abschnitt (113) des Durchgangslochs (111) in dem Durchgangsloch (111) ist.

source: 9. The ferrule according to any one of claims 1 to 7, wherein a length of the first section (113) of through hole (111) is greater than or equal to the first preset distance.
de_de: 9. Ferrule nach einem der Ansprüche 1 bis 7, wobei eine Länge des ersten Abschnitts (113) des Durchgangslochs (111) größer oder gleich des ersten voreingestellten Abstands ist.

source: The ferrule according to any one of claims 1 to 8, wherein the first preset distance is greater than 1.8 μm.
de_de: Ferrule nach einem der Ansprüche 1 bis 8, wobei der erste voreingestellte Abstand größer als 1,8 μm ist.

source: The ferrule according to any one of claims 1 to 10, wherein the at least one fiber (12) is a fiber of an optical communications element body.
de_de: Ferrule nach einem der Ansprüche 1 bis 10, wobei die mindestens eine Faser (12) eine Faser eines optischen Kommunikationselementkörpers ist.

source: A fiber connector (10), comprising a housing (200) and at least one ferrule according to any one of claims 1 to 11, wherein the housing (200) is configured to fasten the at least one ferrule.
de_de: Faserverbinder (10), umfassend ein Gehäuse (200) und mindestens eine Ferrule nach einem der Ansprüche 1 bis 11, wobei das Gehäuse (200) dazu konfiguriert ist, die mindestens eine Ferrule zu befestigen.

source: An optical communications element, comprising an optical communications element body and at least one ferrule according to any one of claims 1 to 11, wherein the ferrule is connected to the optical communications element body.
de_de: Optisches Kommunikationselement, umfassend einen optischen Kommunikationselementkörper und mindestens eine Ferrule nach einem der Ansprüche 1 bis 11, wobei die Ferrule mit dem optischen Kommunikationselementkörper verbunden ist.

source: An optical communications element, comprising an optical communications element body and at least one fiber connector (10) according to claim 12, wherein a ferrule of the fiber connector (10) is connected to the optical communications element body.
de_de: Optisches Kommunikationselement, umfassend einen optischen Kommunikationselementkörper und mindestens einen Faserverbinder (10) nach Anspruch 12, wobei eine Ferrule des Faserverbinders (10) mit dem optischen Kommunikationselementkörper verbunden ist.

source: A communications device, comprising a second optical communications element according to claim 14 and a first optical communications element, wherein
de_de: Kommunikationsvorrichtung, umfassend ein zweites optisches Kommunikationselement nach Anspruch 14 und ein erstes optisches Kommunikationselement, wobei

source: the first optical communications element is connected to the second optical communications element by using respective fiber connectors (10).
de_de: das erste optische Kommunikationselement mit dem zweiten optischen Kommunikationselement durch Verwendung entsprechender Faserverbinder (10) verbunden ist.

source: 1. A channel resource coordinated allocation method, wherein a relay device is one of one or more child nodes of an access point, AP, and the method comprises:
de_de: 1. Verfahren zur Kanalressourcenkoordination, wobei eine Relaisvorrichtung einer von einem oder mehreren untergeordneten Knoten eines Zugangspunkts (access point – AP) ist und das Verfahren Folgendes umfasst:

source: receiving (302), by the relay device, first channel allocation information sent by the AP, wherein the first channel allocation information comprises indication information used to indicate a first time period on a subchannel, and the first time period is operation time of the AP on the subchannel, in which the AP communicates with the relay device;
de_de: Empfangen (302) erster Kanalzuteilungsinformationen, die von dem AP gesendet werden, durch die Relaisvorrichtung, wobei die ersten Kanalzuteilungsinformationen Anzeigeinformationen umfassen, die zum Anzeigen eines ersten Zeitraums auf einem Unterkanal verwendet werden, und der erste Zeitraum eine Betriebszeit des AP auf dem Unterkanal ist, in der der AP mit der Relaisvorrichtung kommuniziert;
